var successRes = {
    "result": 1,
    "success": true,
    "err_msg": "请求处理成功",
    "err_code": 8888
}

var dataTpl = {
    "result": 1,
    "success": true,
    "err_msg": "请求处理成功",
    "err_code": 8888
}

export default {

    // 是否开启本模块 mock
    inservice: true,

    // 模拟数据，可通过arg参数动态返回数据
    getList(arg){

        dataTpl.result = {
            "result": [{
                "2016-09": 0,
                "orgId": 3,
                "total": 1,
                "2016-08": 0,
                "2016-07": 0,
                "2016-06": 1,
                "2016-01": 0,
                "2016-04": 0,
                "orgName": "财务部",
                "2016-10": 0,
                "2016-05": 0,
                "2016-02": 0,
                "2016-11": 0,
                "2016-03": 0,
                "2016-12": 0
            }, {
                "2016-09": 0,
                "orgId": 4,
                "total": 2,
                "2016-08": 0,
                "2016-07": 0,
                "2016-06": 1,
                "2016-01": 0,
                "2016-04": 0,
                "orgName": "北京运营部",
                "2016-10": 0,
                "2016-05": 1,
                "2016-02": 0,
                "2016-11": 0,
                "2016-03": 0,
                "2016-12": 0
            }, {
                "2016-09": 0,
                "orgId": 1,
                "total": 2,
                "2016-08": 0,
                "2016-07": 0,
                "2016-06": 1,
                "2016-01": 0,
                "2016-04": 0,
                "orgName": "北京一店",
                "2016-10": 0,
                "2016-05": 1,
                "2016-02": 0,
                "2016-11": 0,
                "2016-03": 0,
                "2016-12": 0
            }], "err_msg": "请求处理成功", "err_code": 8888, "success": "true"
        };
        return dataTpl;
    }


}
